20260824/20260824/Documents/ПроизводствоБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводствоБезЗаказа</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СБ_ДвиженияДрагоценныхМеталлов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлыРасход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Documents/ПроизводствоБезЗаказа/Ext/ObjectModule.bsl
Процедура ПроведениеДрагМеталлов()	
	
	Объект = ЭтотОбъект;
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлыРасход Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);
				
				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		//Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
		
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		
		НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		Склад = Справочники.Склады.ПустаяСсылка();
		ЛигатурныйВес = 0;           
		
		Для Каждого СтрокаТЧ Из Объект.СБ_ДрагоценныеМеталлы Цикл    
			
			Если ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				НоменклатураРодитель = СтрокаТЧ.Номенклатура;
				Характеристика = СтрокаТЧ.Характеристика;
				Склад = ?(ЗначениеЗаполнено(Склад), Склад, СтрокаТЧ.Склад);
				ЛигатурныйВес = СтрокаТЧ.ЛигатурныйВес * СтрокаТЧ.Количество; 
				Серия = СБ_РаботаСДрагоценнымиМеталлами.ПолучитьСериюНоменклатуры(Объект, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, СтрокаТЧ.Количество, СтрокаТЧ.Серия);
				
				ЕдиницаИзмеренияВеса = СтрокаТЧ.ЕдиницаИзмерения;
				
				Продолжить;
			КонецЕсли;     
			
			Если СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Склад) Тогда
				Продолжить;	
			КонецЕсли;
			
			Движение = Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Объект.Дата;
			Движение.Регистратор = Объект;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.НоменклатураРодитель = НоменклатураРодитель;
			Движение.Характеристика = Характеристика;
			Движение.Серия = Серия;
			Движение.Склад = Склад;
			Движение.ЛигатурныйВес = ЛигатурныйВес;
			Движение.ЕдиницаИзмеренияВеса = ЕдиницаИзмеренияВеса;
			Движение.ЧистыйВес = СтрокаТЧ.ЧистыйВес;
			
		КонецЦикла;
		
		
		
	Исключение      
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Объект.Движения.СБ_ДвиженияДрагоценныхМеталлов.Записать();
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура СБ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Вставка
	ПроведениеДрагМеталлов();
	#КонецВставки

	ИнициализироватьПараметрыЗаполненияВидовЗапасовДляПроведения(ЭтотОбъект);

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ПроизводствоБезЗаказаЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

КонецПроцедуры
